app/views/customers/show.html.erb

<p>
	<%@customer.bikes.each do |bike| %>
---
SELECT "bikes".* FROM "bikes"  WHERE "bikes"."customer_id" = ?  [["customer_id", 2]]