app/views/bikes/_form.html.erb

    <%= f.label :category_id %><br>
    <%= f.collection_select :category_id, Category.all, :id, :name%>
---
SELECT "categories".* FROM "categories"

    <%= f.label :customer_id %><br>
    <%= f.collection_select :customer_id, Customer.all, :id, :name%>
---
SELECT "customers".* FROM "customers"