app/views/bikes/show.html.erb


<%if @bike.repairs.empty? %>
---
SELECT  1 AS one FROM "repairs"  WHERE "repairs"."bike_id" = ? LIMIT 1  [["bike_id", 8]]
SELECT "repairs".* FROM "repairs"  WHERE "repairs"."bike_id" = ?  [["bike_id", 4]]