app/controllers/bikes_controller.rb

  def index
    @bikes = Bike.all
---
SELECT "bikes".* FROM "bikes"

    def search
	@bikes = Bike.search params[:query]
	unless @bikes.empty?
---
SELECT "bikes".* FROM "bikes"  WHERE (name LIKE'%Animator %')
SELECT COUNT(*) FROM "bikes"  WHERE (name LIKE'%Animator %')

  def create
    @bike = Bike.new(bike_params)

    respond_to do |format|
      if @bike.save
---
INSERT INTO "bikes" ("category_id", "created_at", "customer_id", "description", "maker", "name", "picture", "price", "size", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @bike.update(bike_params)
---
UPDATE "bikes" SET "name" = ?, "picture" = ?, "updated_at" = ? WHERE "bikes"."id" = 3  [["name", "Z3"], ["picture", "feltbicylcez3.jpg"], ["updated_at", "2016-10-06 15:24:41.233466"]]

  def destroy
    @bike.destroy
---
DELETE FROM "bikes" WHERE "bikes"."id" = ?  [["id", 1]]

    def set_bike
      @bike = Bike.find(params[:id])
---
SELECT  "bikes".* FROM "bikes"  WHERE "bikes"."id" = ? LIMIT 1  [["id", 4]]