app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2016-10-05 13:32:34.280816"], ["name", "Mountain Bike"], ["updated_at", "2016-10-05 13:32:34.280816"]]