app/controllers/customers_controller.rb

  def create
    @customer = Customer.new(customer_params)

    respond_to do |format|
      if @customer.save
---
INSERT INTO "customers" ("address", "created_at", "dob", "email", "latitude", "longitude", "name", "password_digest", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @customer.update(customer_params)
---
UPDATE "customers" SET "password_digest" = ?, "phone_number" = ?, "updated_at" = ? WHERE "customers"."id" = 5  [["password_digest", "$2a$10$9Bp/5QjU.c7Fl3.tX0Ozk.rebDB5HPJzQbF8hNaeT1.WjRGmtOcNa"], ["phone_number", 857791123], ["updated_at", "2016-11-03 14:13:43.344134"]]