app/controllers/mechanics_controller.rb

SELECT "mechanics".* FROM "mechanics"
---
  def index
    @mechanics = Mechanic.all

SELECT "mechanics".* FROM "mechanics"  WHERE (name LIKE'%Test')
SELECT COUNT(*) FROM "mechanics"  WHERE (name LIKE'%Test')
---
  def search
	@mechanics = Mechanic.search params[:query]
	unless @mechanics.empty?

INSERT INTO "mechanics" ("created_at", "email", "name", "password_digest", "qualifications", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @mechanic = Mechanic.new(mechanic_params)

    respond_to do |format|
      if @mechanic.save

UPDATE "mechanics" SET "password_digest" = ?, "updated_at" = ? WHERE "mechanics"."id" = 1  [["password_digest", "12345"], ["updated_at", "2016-10-06 16:17:04.668899"]]
---
  def update
    respond_to do |format|
      if @mechanic.update(mechanic_params)

DELETE FROM "mechanics" WHERE "mechanics"."id" = ?  [["id", 1]]
---
  def destroy
    @mechanic.destroy

SELECT  "mechanics".* FROM "mechanics"  WHERE "mechanics"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_mechanic
      @mechanic = Mechanic.find(params[:id])