app/controllers/repairs_controller.rb

SELECT  "bikes".* FROM "bikes"  WHERE "bikes"."id" = ? LIMIT 1  [["id", 8]]
---
	def create
		@bike = Bike.find params[:bike_id]