app/controllers/sessions_controller.rb

  def create
	mechanic = Mechanic.find_by_name(params[:name])
---
SELECT  "mechanics".* FROM "mechanics"  WHERE "mechanics"."name" = 'Shane Derwin' LIMIT 1

	def customercreate
	customer = Customer.find_by_email(params[:email])
---
SELECT  "customers".* FROM "customers"  WHERE "customers"."email" IS NULL LIMIT 1