app/views/categories/show.html.erb

<p>
	<%@category.bikes.each do |bike| %>
---
SELECT "bikes".* FROM "bikes"  WHERE "bikes"."category_id" = ?  [["category_id", 2]]